cleanup: cleaned up MD files
